Ocanath/mag-sensor-uart/mag-uart-sensor.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F0
ProjectManager.MainLocation=Core/Src
PCC.Seq0.Step0.Category=In DS Table
RCC.MCOFreq_Value=16000000
PCC.Series=STM32F0
RCC.USART1Freq_Value=16000000
ProjectManager.ProjectFileName=mag-uart-sensor.ioc
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F030C6Tx
Mcu.PinsNb=9
Dma.ADC.0.Mode=DMA_CIRCULAR
PCC.Seq0.Step0.Average_Current=4.49 mA
PCC.Vdd=3.6
ProjectManager.NoMain=false
PCC.Seq0.Step0.CPU_Frequency=8 MHz
USART1.BaudRate=230400
PCC.Seq0.Step0.User's_Consumption=0 mA
RCC.PLLCLKFreq_Value=16000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_ADC_Init-ADC-false-HAL-true,5-MX_USART1_UART_Init-USART1-false-HAL-true
Dma.ADC.0.Priority=DMA_PRIORITY_LOW
ProjectManager.DefaultFWLocation=true
ADC.IPParameters=ContinuousConvMode,EOCSelection,DMAContinuousRequests
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeletePrevious=true
PCC.Line=STM32F0x0 Value Line
USART1.IPParameters=VirtualMode-Asynchronous,BaudRate,VirtualMode-Hardware Flow Control (RS485)
PCC.Seq0.Step1.Duration=0.9 s
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
Dma.ADC.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA13.Signal=SYS_SWDIO
Mcu.IP4=SYS
RCC.FCLKCortexFreq_Value=16000000
Mcu.IP5=USART1
Mcu.IP2=NVIC
PCC.Seq0.Step1.Oscillator=Regulator_LP
Mcu.IP3=RCC
PCC.Seq0.Step0.TaMax=104.11
Mcu.IP0=ADC
PCC.MCU=STM32F030C6Tx
PA12.Locked=true
Mcu.IP1=DMA
PA12.Signal=USART1_DE
PCC.PartNumber=STM32F030C6Tx
Mcu.UserConstants=
ProjectManager.TargetToolchain=STM32CubeIDE
PCC.Seq0.Step1.User's_Consumption=0 mA
Mcu.ThirdPartyNb=0
Dma.ADC.0.PeriphInc=DMA_PINC_DISABLE
PCC.Seq0.Step0.Mode=RUN
RCC.HCLKFreq_Value=16000000
Mcu.IPNb=6
ProjectManager.PreviousToolchain=STM32CubeIDE
PB6.Signal=USART1_TX
PCC.Seq0.Step1.TaMax=105
PB6.Mode=Asynchronous
Mcu.Pin6=PB6
Mcu.Pin7=PB7
ProjectManager.RegisterCallBack=
Mcu.Pin8=VP_SYS_VS_Systick
PCC.Seq0.Step1.Category=In DS Table
PA1.Signal=ADC_IN1
RCC.AHBFreq_Value=16000000
Mcu.Pin0=PA0
Mcu.Pin1=PA1
Dma.ADC.0.Direction=DMA_PERIPH_TO_MEMORY
Mcu.Pin2=PA4
Mcu.Pin3=PA12
Mcu.Pin4=PA13
Mcu.Pin5=PA14
ProjectManager.ProjectBuild=false
ADC.DMAContinuousRequests=DISABLE
PA0.Locked=true
PCC.Seq0.Step1.Vdd=3.6
board=custom
PA4.Locked=true
PCC.Seq0.Step0.Voltage_Source=Battery
PCC.Temperature=25
PCC.Seq0.Step0.DMIPS=0.0
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
RCC.PLLMUL=RCC_PLL_MUL4
Dma.ADC.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
ProjectManager.FirmwarePackage=STM32Cube FW_F0 V1.11.0
MxDb.Version=DB.6.0.0
PA1.Mode=IN1
PCC.Seq0.Step0.Frequency=8 MHz
ProjectManager.BackupPrevious=false
PCC.Seq0.Step0.Vcore=No Scale
MxCube.Version=6.0.0
PA14.Mode=Serial_Wire
USART1.VirtualMode-Hardware\ Flow\ Control\ (RS485)=VM_ASYNC
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
PA0.Mode=IN0
PB7.Signal=USART1_RX
ADC.EOCSelection=ADC_EOC_SEQ_CONV
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB6.Locked=true
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLMUL,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USART1Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F030C6Tx
Dma.RequestsNb=1
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=mag-uart-sensor
ProjectManager.UnderRoot=true
PA0.Signal=ADC_IN0
Dma.ADC.0.MemInc=DMA_MINC_ENABLE
RCC.PLLMCOFreq_Value=16000000
ProjectManager.CoupleFile=false
PCC.Seq0.Step0.Memory=FLASH
PCC.Seq0.Step0.Oscillator=HSI All IPs ON
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=16000000
Mcu.Package=LQFP48
RCC.TimSysFreq_Value=16000000
PA1.Locked=true
PA12.Mode=Hardware Flow Control (RS485)
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PA14.Locked=true
PA13.Locked=true
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
Dma.ADC.0.Instance=DMA1_Channel1
PCC.Seq0.Step1.Average_Current=7.9 \u00B5A
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PB7.Mode=Asynchronous
PA14.Signal=SYS_SWCLK
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PCC.Checker=false
ProjectManager.ComputerToolchain=false
PCC.Seq0.Step1.Frequency=0 Hz
PCC.Seq0.Step0.Duration=1 s
Dma.ADC.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
PCC.Seq0.Step1.DMIPS=0.0
PB7.Locked=true
RCC.APB1TimFreq_Value=16000000
PCC.Seq0.Step1.Peripherals=
PCC.Seq0.Step1.Vcore=No Scale
PCC.Seq0.Step0.Peripherals=
PCC.Seq0.Step1.Voltage_Source=Battery
NVIC.DMA1_Channel1_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PCC.Seq0.Step0.Vdd=3.6
NVIC.USART1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PCC.Seq0=2
Dma.Request0=ADC
RCC.APB1Freq_Value=16000000
PCC.Seq0.Step1.Mode=STOP
ADC.ContinuousConvMode=ENABLE
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32F030C6Tx
ProjectManager.LibraryCopy=1
PCC.Seq0.Step1.CPU_Frequency=0 Hz
PCC.Seq0.Step1.Memory=n/a
isbadioc=false
